#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.rains_cafe.aws_route53_zone.zone: Refreshing state... [id=Z06483271SZJRBE1MH2SU]
module.cecilias_me.aws_route53_zone.zone: Refreshing state... [id=Z06486853N99I77BEB96I]
module.cecilias_me.aws_route53_record.record["smp.cecilias.me_A"]: Refreshing state... [id=Z06486853N99I77BEB96I_smp_A]
module.cecilias_me.aws_route53_record.record["origins.cecilias.me_A"]: Refreshing state... [id=Z06486853N99I77BEB96I_origins_A]
module.cecilias_me.aws_route53_record.record["atm.cecilias.me_A"]: Refreshing state... [id=Z06486853N99I77BEB96I_atm_A]
module.cecilias_me.aws_route53_record.record["github.cecilias.me_CNAME"]: Refreshing state... [id=Z06486853N99I77BEB96I_github_CNAME]
module.rains_cafe.aws_route53_record.record[".rains.cafe_AAAA"]: Refreshing state... [id=Z06483271SZJRBE1MH2SU__AAAA]
module.rains_cafe.aws_route53_record.record[".rains.cafe_A"]: Refreshing state... [id=Z06483271SZJRBE1MH2SU__A]
module.rains_cafe.aws_route53_record.record["www.rains.cafe_CNAME"]: Refreshing state... [id=Z06483271SZJRBE1MH2SU_www_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rains_cafe.aws_route53_record.record["silvy.rains.cafe_CNAME"] will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "silvy"
      + records         = [
          + "cname.vercel-dns.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z06483271SZJRBE1MH2SU"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cecilia-sanare, Action: `pull_request`, Working Directory: ``, Workflow: `build`*